# GetKeyBasedTreeEntries Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntryTable..::..GetKeyBasedTreeEntries Method
KeyBasedTreeEntryTable Class See Also
---
Gets the KeyBasedTreeEntries for this table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntries GetKeyBasedTreeEntries()
```

Visual Basic
---
```text
Public Function GetKeyBasedTreeEntries As KeyBasedTreeEntries
```

Visual C++
---
```text
public:
KeyBasedTreeEntries^ GetKeyBasedTreeEntries()
```

# ### Return Value
The KeyBasedTreeEntries for this table.
# See Also
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace